In [ ]:
"""
For table actor

actor_id	first_name	last_name	last_update
1	PENELOPE	GUINESS	2006-02-15 12:34:33
2	NICK	WAHLBERG	2006-02-15 12:34:33

create a table actor_name with the following structure
column      type        isnull
first_name	varchar(45)	not null	
last_name	varchar(45)	not null	

insert all the first_name and last_name from actor into actor_name
"""

In [ ]:
"""SQL solution"""
CREATE TABLE IF NOT EXISTS actor_name(
    first_name VARCHAR(45) NOT NULL,
    last_name VARCHAR(45) NOT NULL)
SELECT first_name, last_name
FROM actor;

In [4]:
"""pandas daraframe creation"""
import pandas as pd

actor = pd.DataFrame([[1,	'PENELOPE',	'GUINESS',	'2006-02-15 12:34:33'],
                      [2,	'NICK',	'WAHLBERG',	'2006-02-15 12:34:33']],
                     columns=['actor_id', 'first_name', 'last_name', 'last_update'])
actor.head()

   actor_id first_name last_name          last_update
0         1   PENELOPE   GUINESS  2006-02-15 12:34:33
1         2       NICK  WAHLBERG  2006-02-15 12:34:33

In [6]:
actor_name = pd.DataFrame(columns=['first_name', 'last_name'])
actor_name.head()

Empty DataFrame
Columns: [first_name, last_name]
Index: []

In [7]:
actor_name[['first_name', 'last_name']] = actor[['first_name', 'last_name']]
actor_name

  first_name last_name
0   PENELOPE   GUINESS
1       NICK  WAHLBERG

In [10]:
# changes made to actor will not be applied to actor_name
actor.iloc[-1,1] = 'JACK'
print(actor)
print(actor_name)

   actor_id first_name last_name          last_update
0         1   PENELOPE   GUINESS  2006-02-15 12:34:33
1         2       JACK  WAHLBERG  2006-02-15 12:34:33
  first_name last_name
0   PENELOPE   GUINESS
1       NICK  WAHLBERG